app/views/conversations/_form.html.erb

    <%= form.label :tag_ids, "Tags" %>
    <%= form.collection_check_boxes :tag_ids, Tag.all, :id, :name %>
---
SELECT "tags".* FROM "tags"