app/views/conversations/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "conversation_tags" ON "tags"."id" = "conversation_tags"."tag_id" WHERE "conversation_tags"."conversation_id" = ?  [["conversation_id", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "conversation_categories" ON "categories"."id" = "conversation_categories"."category_id" WHERE "conversation_categories"."conversation_id" = ?  [["conversation_id", 1]]
---
        <td><%= conversation.content %></td>
        <td><%= conversation.tags.map(&:name).join(', ') %></td>
        <td><%= conversation.categories.map(&:name).join(', ') %></td>