app/controllers/conversations_controller.rb

  def index
    if params[:tag_id]
      @conversations = Tag.find(params[:tag_id]).conversations
    else
      @conversations = Conversation.all
---
SELECT "conversations".* FROM "conversations"

  def update
    @conversation = Conversation.find(params[:id])
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @conversation = Conversation.new
    @tags = Tag.all
    @categories = Category.all
---
SELECT "tags".* FROM "tags"
SELECT "categories".* FROM "categories"

  def edit
    @conversation = Conversation.find(params[:id])
    @tags = Tag.all
    @categories = Category.all
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags"
SELECT "categories".* FROM "categories"

  def destroy
    @conversation = Conversation.find(params[:id])
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @conversation = Conversation.new(conversation_params)

    if @conversation.save
---
INSERT INTO "conversations" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"