app/controllers/search_controller.rb

  def search_results(query)
  tag_results = Tag.where("lower(name) LIKE ?", "%#{query.downcase}%")

  category_results = Category.where("lower(name) LIKE ?", "%#{query.downcase}%")
---
SELECT "categories".* FROM "categories" WHERE (lower(name) LIKE '%%')
SELECT "tags".* FROM "tags" WHERE (name ILIKE '%%')