app/controllers/talks_controller.rb

  def index
    @talks = Talk.all
---
SELECT "talks".* FROM "talks"

  def create
    @talk = Talk.new(talk_params)

    respond_to do |format|
      if @talk.save
---
INSERT INTO "talks" ("topic", "tribe", "importance", "created_at", "updated_at", "content") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["topic", "woman"], ["tribe", "tribe1"], ["importance", "2"], ["created_at", "2024-01-24 11:34:15.304940"], ["updated_at", "2024-01-24 11:34:15.304940"], ["content", nil]]

  def update
    respond_to do |format|
      if @talk.update(talk_params)
---
UPDATE "talks" SET "importance" = ?, "updated_at" = ? WHERE "talks"."id" = ?  [["importance", "5"], ["updated_at", "2024-01-20 04:02:34.137507"], ["id", 1]]

  def destroy
    @talk.destroy!
---
DELETE FROM "talks" WHERE "talks"."id" = ?  [["id", 1]]

    def set_talk
      @talk = Talk.find(params[:id])
---
SELECT "talks".* FROM "talks" WHERE "talks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]