app/controllers/tribes_controller.rb

  def index
    @tribes = Tribe.all
---
SELECT "tribes".* FROM "tribes"

  def create
    # @tribe = Tribe.new(tribe_params)
    @tribe = current_user.tribes.build(tribe_params)

    respond_to do |format|
      if @tribe.save
---
INSERT INTO "tribes" ("tribe", "tribesmen", "chief", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["tribe", "2323"], ["tribesmen", ""], ["chief", ""], ["created_at", "2024-01-20 07:37:48.811180"], ["updated_at", "2024-01-20 07:37:48.811180"], ["user_id", 6]]

  def update
    respond_to do |format|
      if @tribe.update(tribe_params)
---
UPDATE "tribes" SET "chief" = ?, "updated_at" = ? WHERE "tribes"."id" = ?  [["chief", "Alice"], ["updated_at", "2024-01-24 13:35:06.472889"], ["id", 26]]

  def destroy
    @tribe = Tribe.find(params[:id])
    @tribe.destroy
---
SELECT "tribes".* FROM "tribes" WHERE "tribes"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
DELETE FROM "tribes" WHERE "tribes"."id" = ?  [["id", 23]]

   def correct_user
    @tribe = current_user.tribes.find_by(id: params[:id])
---
SELECT "tribes".* FROM "tribes" WHERE "tribes"."user_id" = ? AND "tribes"."id" = ? LIMIT ?  [["user_id", 6], ["id", 23], ["LIMIT", 1]]

    def set_tribe
      @tribe = Tribe.find(params[:id])
---
SELECT "tribes".* FROM "tribes" WHERE "tribes"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]